jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
	#if SOC_WIFI_SUPPORT_5G
    JsonObject mode5g = wifiBands.add<JsonObject>();
    mode5g["name"] = "5ghz";
    mode5g["value"] = (uint8_t)WifiBand::MODE5ghz;
    #endif
	#if SOC_WIFI_SUPPORT_6G
    JsonObject mode6g = wifiBands.add<JsonObject>();
    mode6g["name"] = "56ghz";
    c5Demode6gvkit["value"] = (uint8_t)WifiMode::MODE6ghz;
    #endif
        int motorType = MOTOR_TYPE_DEFAULT;
        m_settingsFactory->getValue(MOTOR_TYPE_SETTING, motorType);
        doc["motorType"] = motorType;
        JsonArray buildFeaturesJsonArray = doc["buildFeatures"].to<JsonArray>();
        for (BuildFeature value : buildFeatures)
        {
            buildFeaturesJsonArray.add((int)value);
        }
        doc["moduleType"] = (int)MODULE_CURRENT;

        JsonArray availableTagsJsonArray = doc["availableTags"].to<JsonArray>();
        for (const char *tag : TagHandler::AvailableTags)
        {
            availableTagsJsonArray.add(tag);
        }
        JsonArray systemI2CAddressesJsonArray = doc["systemI2CAddresses"].to<JsonArray>();
        systemI2CAddressesJsonArray.add("0x0");
        for (int value : systemI2CAddresses) {
			char buf[10];
            hexToString(value, buf);
            systemI2CAddressesJsonArray.add(buf);
        }

        int deviceType = DEVICE_TYPE_DEFAULT;
        m_settingsFactory->getValue(DEVICE_TYPE, deviceType);
        JsonArray deviceTypes = doc["deviceTypes"].to<JsonArray>();
        JsonObject defaultDevice = deviceTypes.add<JsonObject>();
    #ifdef MOTOR_TYPE_SERVO
        defaultDevice["name"] = DEVICE_TYPE_NAME_DEFAULT;
        defaultDevice["value"] = DEVICE_TYPE_DEFAULT;
        JsonObject SR6 = deviceTypes.add<JsonObject>();
        SR6["name"] = "SR6";
        SR6["value"] = DeviceType::SR6;
        JsonObject TVIBE = deviceTypes.add<JsonObject>();
        TVIBE["name"] = "TVIBE";
        TVIBE["value"] = DeviceType::TVIBE;
    #elif defined MOTOR_TYPE_BLDC
        defaultDevice["name"] = DEVICE_TYPE_NAME_DEFAULT;
        defaultDevice["value"] = DEVICE_TYPE_DEFAULT;
        JsonObject SSR1 = deviceTypes.add<JsonObject>();
        SSR1["name"] = "SSR1";
        SSR1["value"] = DeviceType::SSR1;
        JsonObject SSR2 = deviceTypes.add<JsonObject>();
        SSR2["name"] = "SSR2";
        SSR2["value"] = DeviceType::SSR2;
        JsonArray encoderTypes = doc["encoderTypes"].to<JsonArray>();
        JsonObject defaultEncoder = encoderTypes.add<JsonObject>();
        defaultEncoder["name"] = "NONE";
        defaultEncoder["value"] = BLDCEncoderType::NONE;
        if(static_cast<DeviceType>(deviceType) != DeviceType::SSR2)
        {
            JsonObject MT6701 = encoderTypes.add<JsonObject>();
            MT6701["name"] = "MT6701 SSI";
            MT6701["value"] = BLDCEncoderType::MT6701;
            JsonObject PWM = encoderTypes.add<JsonObject>();
            PWM["name"] = "PWM";
            PWM["value"] = BLDCEncoderType::PWM;
        }
        JsonObject SPI = encoderTypes.add<JsonObject>();
        SPI["name"] = "SPI";
        SPI["value"] = BLDCEncoderType::SPI;
    #endif

        JsonArray bleDeviceTypes = doc["bleDeviceTypes"].to<JsonArray>();
        JsonObject defaultBleDevice = bleDeviceTypes.add<JsonObject>();
        defaultBleDevice["name"] = "TCode";
        defaultBleDevice["value"] = BLEDeviceType::TCODE;
        JsonObject loveDevice = bleDeviceTypes.add<JsonObject>();
        loveDevice["name"] = "Love";
        loveDevice["value"] = BLEDeviceType::LOVE;
        JsonObject hcDevice = bleDeviceTypes.add<JsonObject>();
        // HC has an unknown formatting.
        hcDevice["name"] = "HC";
        hcDevice["value"] = BLEDeviceType::HC;

        JsonArray bleLoveDevices = doc["bleLoveDeviceTypes"].to<JsonArray>();
        JsonObject defaultLoveDevice = bleLoveDevices.add<JsonObject>();
        defaultLoveDevice["name"] = "Edge";
        defaultLoveDevice["value"] = BLELoveDeviceType::EDGE;
        

        JsonArray availableChannels = doc["availableChannels"].to<JsonArray>();
        channelMap.serialize(availableChannels);
        doc[MOTION_ENABLED] = getMotionEnabled();
        // int motionProfileSelectedIndex = MOTION_PROFILE_SELECTED_INDEX_DEFAULT;
        // m_settingsFactory->getValue(MOTION_PROFILE_SELECTED_INDEX, motionProfileSelectedIndex);
        doc[MOTION_PROFILE_SELECTED_INDEX] = motionSelectedProfileIndex; 

        JsonArray availableTimers = doc["availableTimers"].to<JsonArray>();
        JsonArray timerChannels = doc["timerChannels"].to<JsonArray>();
        JsonObject timerChannelNoneObj = timerChannels.add<JsonObject>();
        timerChannelNoneObj["name"] = "None";
        timerChannelNoneObj["value"] = ESPTimerChannelNum::NONE;
        PinMap* pinMap = m_settingsFactory->getPins();
        for (size_t i = 0; i < MAX_TIMERS; i++)
        {
            JsonObject timerObj = availableTimers.add<JsonObject>();
            ESPTimer* timer = pinMap->getTimer(i);
            timerObj["id"] = timer->id;
            timerObj["name"] = timer->name;
            timerObj["value"] = i;
            for (size_t j = 0; j < 2; j++)
            {
                JsonObject timerChannelObj = timerChannels.add<JsonObject>();
                timerChannelObj["name"] = timer->channels[j].name;
                timerChannelObj["value"] = timer->channels[j].channel;
            }
        }

        doc["localIP"] = currentIP;
        doc["gateway"] = currentGateway;
        doc["subnet"] = currentSubnet;
        doc["dns1"] = currentDns1;
        doc["dns2"] = currentDns2;// Not being used currently
        char macTemp[18] = {0};
		#ifdef ESP_ARDUINO3
        strlcpy(macTemp, Network.macAddress().c_str(), sizeof(macTemp));
		#else
        strlcpy(macTemp, WiFi.macAddress().c_str(), sizeof(macTemp));
		#endif
		doc["mac"] = macTemp;

        doc["chipModel"] = ESP.getChipModel();
        doc["chipRevision"] = ESP.getChipRevision();
        doc["chipCores"] = ESP.getChipCores();
        uint32_t chipId = 0;
        for (int i = 0; i < 17; i = i + 8)
        {
            chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
        }
        doc["chipID"] = chipId;

