jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
            //auto buttonSetArray = doc["buttonSets"].as<JsonArray>();
            std::vector<int> pins;
            for (size_t i = 0; i < MAX_BUTTON_SETS; i++)
            {
                //JsonObject obj;
                doc["buttonSets"][i]["name"] = buttonSets[i].name;
                
                doc["buttonSets"][i]["pin"] = buttonSets[i].pin;
                pins.push_back(buttonSets[i].pin);
                doc["buttonSets"][i]["pullMode"] = (uint8_t)buttonSets[i].pullMode;
                LogHandler::debug(_TAG, "Saving button set '%s' from settings, pin: %ld",  doc["buttonSets"][i]["name"].as<const  char*>(), doc["buttonSets"][i]["pin"].as<int>());
                for(size_t j = 0; j < MAX_BUTTONS; j++) {
                    doc["buttonSets"][i]["buttons"][j]["name"] = buttonSets[i].buttons[j].name;
                    doc["buttonSets"][i]["buttons"][j]["index"] = buttonSets[i].buttons[j].index;
                    doc["buttonSets"][i]["buttons"][j]["command"] = buttonSets[i].buttons[j].command;
                    LogHandler::debug(_TAG, "Saving button, name: %s, index: %u, command: %s", doc["buttonSets"][i]["buttons"][j]["name"].as<const char*>(), doc["buttonSets"][i]["buttons"][j]["index"].as<int>(), doc["buttonSets"][i]["buttons"][j]["command"].as<const char*>());
                }
                //buttonSetArray.add(obj);
            }
            m_settingsFactory->setValue(BUTTON_SET_PINS, pins);
            m_settingsFactory->savePins();
            return true;
        }, loadButtons, json);
    }

    static bool loadMotionProfiles(bool loadDefault, JsonObject json = JsonObject()) {
        LogHandler::info(_TAG, "Loading motion profiles");
        // bool mutableLoadDefault = loadDefault;
        // JsonDocument doc; //deserializeSize
        // if(mutableLoadDefault || json.isNull()) {
		//     xSemaphoreTake(m_motionMutex, portMAX_DELAY);
        //     if(!checkForFileAndLoad(MOTION_PROFILE_SETTINGS_PATH, doc, mutableLoadDefault)) {
        //         saving = false;
        //         xSemaphoreGive(m_motionMutex);
        //         return false;
        //     }
        //     json = doc.as<JsonObject>();
        // }
        return loadSettingsJson(MOTION_PROFILE_SETTINGS_PATH, loadDefault, m_motionMutex, [](const JsonObject json, bool& mutableLoadDefault) -> bool {
            motionDefaultProfileIndex = json[MOTION_PROFILE_DEFAULT_INDEX] | MOTION_PROFILE_SELECTED_INDEX_DEFAULT;
            if(!initialized)
                motionSelectedProfileIndex = motionDefaultProfileIndex;
                
            JsonArray motionProfilesObj = json[MOTION_PROFILES].as<JsonArray>();
            if(motionProfilesObj.isNull()) {
                LogHandler::info(_TAG, "No motion profiles stored, loading default");
                mutableLoadDefault = true;
                for(int i = 0; i < MAX_MOTION_PROFILE_COUNT; i++) {
                    motionProfiles[i] = MotionProfile(i + 1);
                    motionProfiles[i].addDefaultChannel("L0");
                    LogHandler::debug(_TAG, "Added new Motion profile for: %s", motionProfiles[i].channels.back().name);
                }
            } else {
                int i = 0;
                for (JsonObject profileObj : motionProfilesObj) {
                    auto profile = MotionProfile();
                    profile.fromJson(profileObj);
                    LogHandler::debug(_TAG, "Loading motion profile '%s' from settings", profile.motionProfileName);
                    motionProfiles[i] = profile;
                    i++;
                }
            }
        //xSemaphoreGive(m_motionMutex);
        // if(mutableLoadDefault)
        //     saveMotionProfiles();
        return true;
        }, saveMotionProfiles, json);
    }

    static bool saveMotionProfiles(JsonObject json = JsonObject()) {
        LogHandler::info(_TAG, "Save motion profiles file");
        saving = true;
		xSemaphoreTake(m_motionMutex, portMAX_DELAY);
        if (!LittleFS.exists(MOTION_PROFILE_SETTINGS_PATH)) {
            LogHandler::error(_TAG, "Motion profile file did not exist whan saving.");
            saving = false;
            xSemaphoreGive(m_motionMutex);
            return false;
        }
        if(!json.isNull()) { // If passed in, load the json into memory before flushing it to disk.
            // WARNING: watchout for the mutex taken in this method. Changing these parameters below may result in hard locks.
            loadMotionProfiles(false, json); // DO NOT PASS loadDefault as true else infinit loop
        }
        JsonDocument doc; //serializeSize
        doc[MOTION_PROFILE_DEFAULT_INDEX] = motionDefaultProfileIndex;
        LogHandler::debug(_TAG, "motion profiles index: %ld", motionDefaultProfileIndex);

        for (int i=0; i < MAX_MOTION_PROFILE_COUNT; i++) {
            //if(motionProfiles[i].edited) { // TODO: this does not work because doc is empty and needs to be loaded from disk first bedore modifying sections of it.

                LogHandler::debug(_TAG, "Edited motion profile name: %s", motionProfiles[i].motionProfileName);
                doc[MOTION_PROFILES][i]["name"] = motionProfiles[i].motionProfileName;
                for (size_t j = 0; j < motionProfiles[i].channels.size(); j++) {
                    //if(motionProfiles[i].channels[j].edited) {
                        LogHandler::debug(_TAG, "motion profile channel: %s", motionProfiles[i].channels[j].name);
                        doc[MOTION_PROFILES][i]["channels"][j]["name"] = motionProfiles[i].channels[j].name;
                        doc[MOTION_PROFILES][i]["channels"][j]["update"] = motionProfiles[i].channels[j].motionUpdateGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["period"] = motionProfiles[i].channels[j].motionPeriodGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["amp"] = motionProfiles[i].channels[j].motionAmplitudeGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["offset"] = motionProfiles[i].channels[j].motionOffsetGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["phase"] = motionProfiles[i].channels[j].motionPhaseGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["reverse"] = motionProfiles[i].channels[j].motionReversedGlobal;
                        doc[MOTION_PROFILES][i]["channels"][j]["periodRan"] = motionProfiles[i].channels[j].motionPeriodGlobalRandom;
                        doc[MOTION_PROFILES][i]["channels"][j]["periodMin"] = motionProfiles[i].channels[j].motionPeriodGlobalRandomMin;
                        doc[MOTION_PROFILES][i]["channels"][j]["periodMax"] = motionProfiles[i].channels[j].motionPeriodGlobalRandomMax;
                        doc[MOTION_PROFILES][i]["channels"][j]["ampRan"] = motionProfiles[i].channels[j].motionAmplitudeGlobalRandom;
                        doc[MOTION_PROFILES][i]["channels"][j]["ampMin"] = motionProfiles[i].channels[j].motionAmplitudeGlobalRandomMin;
                        doc[MOTION_PROFILES][i]["channels"][j]["ampMax"] = motionProfiles[i].channels[j].motionAmplitudeGlobalRandomMax;
                        doc[MOTION_PROFILES][i]["channels"][j]["offsetRan"] = motionProfiles[i].channels[j].motionOffsetGlobalRandom;
                        doc[MOTION_PROFILES][i]["channels"][j]["offsetMin"] = motionProfiles[i].channels[j].motionOffsetGlobalRandomMin;
                        doc[MOTION_PROFILES][i]["channels"][j]["offsetMax"] = motionProfiles[i].channels[j].motionOffsetGlobalRandomMax;
                        doc[MOTION_PROFILES][i]["channels"][j]["phaseRan"] = motionProfiles[i].channels[j].motionPhaseRandom;
                        doc[MOTION_PROFILES][i]["channels"][j]["phaseMin"] = motionProfiles[i].channels[j].motionPhaseRandomMin;
                        doc[MOTION_PROFILES][i]["channels"][j]["phaseMax"] = motionProfiles[i].channels[j].motionPhaseRandomMax;
                        doc[MOTION_PROFILES][i]["channels"][j]["ranMin"] = motionProfiles[i].channels[j].motionRandomChangeMin;
                        doc[MOTION_PROFILES][i]["channels"][j]["ranMax"] = motionProfiles[i].channels[j].motionRandomChangeMax;
                        motionProfiles[i].channels[j].edited = false;
                    //}
                }
                if(initialized && motionSelectedProfileIndex == i) {
                    sendMessage(SettingProfile::MotionProfile, MOTION_PROFILES);
                }
                motionProfiles[i].edited = false;
            //}
        }
        File file = LittleFS.open(MOTION_PROFILE_SETTINGS_PATH, FILE_WRITE);
        if (serializeJson(doc, file) == 0) {
            LogHandler::error(_TAG, "Failed to write to motion profiles file");
            file.close();
            xSemaphoreGive(m_motionMutex);
            saving = false;
            return false;
        }
        
        xSemaphoreGive(m_motionMutex);
        saving = false;
        return true;
    }

    static bool loadChannels(bool loadDefault, JsonObject json = JsonObject()) {

        MotorType motorType;
        DeviceType deviceType;
        m_settingsFactory->getValue(MOTOR_TYPE_SETTING, motorType);
        m_settingsFactory->getValue(DEVICE_TYPE, deviceType);
        // Init motor type BEFORE loading the channels else it will load the defaults
        channelMap.init(m_settingsFactory->getTcodeVersion(), motorType, deviceType);

