jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
    static const int getDeserializeSize() {
        return deserializeSize;
    }

    // static void processTCodeJson(char *outbuf, const char *tcodeJson)
    // {
    //     StaticJsonDocument<512> doc;
    //     DeserializationError error = deserializeJson(doc, tcodeJson);
    //     if (error)
    //     {
    //         LogHandler::error(_TAG, "Failed to read udp jsonobject, using default configuration");
    //         outbuf[0] = {0};
    //         return;
    //     }
    //     JsonArray arr = doc.as<JsonArray>();
    //     char buffer[MAX_COMMAND] = "";
    //     for (JsonObject repo : arr)
    //     {
    //         const char *channel = repo["c"];
    //         int value = repo["v"];
    //         if (channel != nullptr && value > 0)
    //         {
    //             if (buffer[0] == '\0')
    //             {
    //                 // Serial.println("tcode empty");
    //                 strcpy(buffer, channel);
    //             }
    //             else
    //             {
    //                 strcat(buffer, channel);
    //             }
    //             // Serial.print("channel: ");
    //             // Serial.print(channel);
    //             // Serial.print(" value: ");
    //             // Serial.println(value);
    //             char integer_string[4];
    //             sprintf(integer_string, SettingsHandler::TCodeVersionEnum == TCodeVersion::v0_2 ? "%03d" : "%04d", SettingsHandler::calculateRange(name, value));
    //             // pad(integer_string);
    //             // sprintf(integer_string, "%d", SettingsHandler::calculateRange(name, value));
    //             // Serial.print("integer_string");
    //             // Serial.println(integer_string);
    //             strcat(buffer, integer_string);
    //             int speed = repo["s"];
    //             int interval = repo["i"];
    //             if (interval > 0)
    //             {
    //                 char interval_string[5];
    //                 sprintf(interval_string, "%d", interval);
    //                 strcat(buffer, "I");
    //                 strcat(buffer, interval_string);
    //             }
    //             else if (speed > 0)
    //             {
    //                 char speed_string[5];
    //                 sprintf(speed_string, "%d", speed);
    //                 strcat(buffer, "S");
    //                 strcat(buffer, speed_string);
    //             }
    //             strcat(buffer, " ");
    //             // Serial.print("buffer ");
    //             // Serial.println(buffer);
    //         }
    //     }
    //     strcpy(outbuf, buffer);
    //     strcat(outbuf, "\n");
    //     // Serial.print("outbuf ");
    //     // Serial.println(outbuf);
    // }

    static bool waitForI2CDevices(const int& i2cAddress = 0) {
        int tries = 0;
        if(i2cAddress)
            LogHandler::info(_TAG, "Looking for I2c address: %ld", i2cAddress);
        while((systemI2CAddresses.size() == 0 || i2cAddress) && tries <= 3) {
            tries++;
            I2CScan();
            if(i2cAddress && std::find(systemI2CAddresses.begin(), systemI2CAddresses.end(), i2cAddress) != systemI2CAddresses.end()) {
                return true;
            } else if(i2cAddress) {
                LogHandler::info(_TAG, "I2c address: %ld not found. trying again...", i2cAddress);
            } else if(systemI2CAddresses.size() == 0) {
                LogHandler::info(_TAG, "No I2C devices found in system, trying again...");
            }
            if(tries >= 3){
                if (i2cAddress) {
                    LogHandler::error(_TAG, "I2c address: %ld timed out.", i2cAddress);
                } else {
                    LogHandler::error(_TAG, "No I2C devices found in system");
                }
                return false;
            }
            vTaskDelay(1000/portTICK_PERIOD_MS);
        }
        return true;
    }

	static bool I2CScan() 
	{
        systemI2CAddresses.clear();
		byte error, address;
		int nDevices;
		LogHandler::info(_TAG, "Scanning for I2C...");
		nDevices = 0;
        int8_t sdaPin = I2C_SDA_PIN_DEFAULT;
        m_settingsFactory->getValue(I2C_SDA_PIN, sdaPin);
        int8_t sclPin = I2C_SCL_PIN_DEFAULT;
        m_settingsFactory->getValue(I2C_SCL_PIN, sclPin);
        if(sdaPin < 0 || sclPin < 0) {
		    LogHandler::debug(_TAG, "SDA or SCL is disabled when scaning for I2C devices sdaPin: %d, sclPin: %d", sdaPin, sclPin);
            return false;
        }
		Wire.begin(sdaPin, sclPin);
		for(address = 1; address < 127; address++ ) 
		{
			Wire.beginTransmission(address);
			error = Wire.endTransmission();
			if (error == 0) 
			{
				//Serial.print("I2C device found at address 0x");
				// if (address<16) 
				// {
				// 	Serial.print("0");
				// }
				// Serial.println(address,HEX);

                // std::stringstream I2C_Address_String;
                // I2C_Address_String << "0x" << std::hex << address;
                // std::string foundAddress = I2C_Address_String.str();
                
				char buf[10];
				hexToString(address, buf);
				LogHandler::info(_TAG, "I2C device found at address %s, byte %ld", buf, address);

				systemI2CAddresses.push_back((int)address);
				nDevices++;
			}
			else if (error==4) 
			{
				Serial.print("Unknow error at address 0x");
				if (address<16) 
				{
					Serial.print("0");
				}
				Serial.println(address,HEX);
                // std::stringstream I2C_Address_String;
                // I2C_Address_String << "0x" << std::hex << address;
                // std::string foundAddress = I2C_Address_String.str();
				// LogHandler::error(_TAG, "Unknow error at address %s", foundAddress);
			}    
		}
		if (nDevices == 0) {
			LogHandler::info(_TAG, "No I2C devices found");
			return false;
		}
		return true;
	}
    
    static Channel* getChannel(const char *name) 
    {
        return channelMap.get(name);
    }

    static uint16_t getChannelMin(const char *name) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[getChannelMin] Invalid name for current map: %s", name);
            return TCODE_MIN;
        }
        return channelProfile->min;
    }

    static uint16_t getChannelMax(const char *name) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[getChannelMax] Invalid name for current map: %s", name);
            return TCODE_MAX;
        }
        return channelProfile->max;
    }

