jcfain/TCodeESP32/ESP32/src/SettingsHandler.h
    static uint16_t getChannelUserMin(const char *name) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[getChannelUserMin] Invalid name for current map: %s", name);
            return TCODE_MIN;
        }
        return channelProfile->userMin;
    }

    static uint16_t getChannelUserMax(const char *name) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[getChannelUserMax] Invalid name for current map: %s", name);
            return TCODE_MAX;
        }
        return channelProfile->userMax;
    }

    static void setChannelMin(const char *name, uint16_t value) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[setChannelMin] Invalid name for current map: %s", name);
            return;
        }
        channelProfile->userMin = value;
    }

    static void setChannelMax(const char *name, uint16_t value) 
    {
        Channel* channelProfile = channelMap.get(name);
        if(!channelProfile)
        {
            LogHandler::error(_TAG, "[setChannelMax] Invalid name for current map: %s", name);
            return;
        }
        channelProfile->userMax = value;
    }

    static void setChannelRangesEnabled(bool enabled) {
        channelRangesEnabled = enabled;
        sendMessage(SettingProfile::ChannelRanges, "channelRangesEnabled");
    }
    static bool getChannelRangesEnabled() {
        return channelRangesEnabled;
    }

private:
    static const char *_TAG;
    
    static SettingsFactory* m_settingsFactory;
	static SemaphoreHandle_t m_motionMutex;
    static SemaphoreHandle_t m_channelsMutex;
	static SemaphoreHandle_t m_wifiMutex;
    static SemaphoreHandle_t m_buttonsMutex;
	static SemaphoreHandle_t m_settingsMutex;
    static inline SettingsChangeCallback message_callback = 0;
    // Use http://arduinojson.org/assistant to compute the capacity.
    static const int deserializeSize = 32768;
    static const int serializeSize = 24576;

    static bool motionEnabled;
    static int motionSelectedProfileIndex;
    static int motionDefaultProfileIndex;

    /// @brief Locks the mutex checks for an existing file and creates  it if it doesnt exist. Calls the callback function and gives the mutex.
    /// @param filepath 
    /// @param mutableLoadDefault 
    /// @param mutex 
    /// @param jsonSize 
    /// @param loadFunction 
    /// @param json 
    /// @return 
    static bool loadSettingsJson(const char* filepath, bool loadDefault, SemaphoreHandle_t& mutex, std::function<bool(const JsonObject, bool& mutableLoadDefault)> loadFunction, std::function<bool(JsonObject)> saveFunction, JsonObject json = JsonObject()) {
        JsonDocument doc; //jsonSize
        bool mutableLoadDefault = loadDefault;
        if(mutableLoadDefault || json.isNull()) {
		    xSemaphoreTake(mutex, portMAX_DELAY);
            if(!checkForFileAndLoad(filepath, doc, mutableLoadDefault)) {
                xSemaphoreGive(mutex);
                return false;
            }
            json = doc.as<JsonObject>();
        }
        if(!loadFunction(json, mutableLoadDefault)) {
            xSemaphoreGive(mutex);
            return false;
        }
        xSemaphoreGive(mutex);
        if(mutableLoadDefault)
            saveFunction(JsonObject());
        return true;
    }

    /// @brief Locks the mutex and validates the file exists. calls the calback and serializes the data in a file to disk. Releases the mutex.
    /// @param filepath 
    /// @param mutex 
    /// @param jsonSize 
    /// @param saveFunction 
    /// @param json 
    /// @return 
    static bool saveSettingsJson(const char* filepath, SemaphoreHandle_t& mutex, int jsonSize, std::function<bool(JsonDocument&)> saveFunction, std::function<bool(bool, JsonObject)> loadFunction, JsonObject json = JsonObject()) {
        saving = true;
		xSemaphoreTake(mutex, portMAX_DELAY);
        LogHandler::debug(_TAG, "Saving File: %s", filepath);
        bool loadBeforeSetting = false;
        if (!LittleFS.exists(filepath)) {
            LogHandler::error(_TAG, "File did not exist whan saving: %s", filepath);
            xSemaphoreGive(mutex);
            saving = false;
            return false;
        } else {
            if(!json.isNull()) {
                LogHandler::debug(_TAG, "Loading from input json: %s", filepath);
                xSemaphoreGive(mutex);
                if(!loadFunction(false, json)){
                    LogHandler::error(_TAG, "File loading input json failed: %s", filepath);
                    return false;
                }
		        xSemaphoreTake(mutex, portMAX_DELAY);
            }
            LogHandler::debug(_TAG, "jsonSize: %ld", jsonSize);
            JsonDocument doc; //jsonSize
            if(!saveFunction(doc)) {
                LogHandler::error(_TAG, "Failed to compile JSON object: %s", filepath);
                xSemaphoreGive(mutex);
                saving = false;
                return false;
            }
            LogHandler::debug(_TAG, "Doc overflowed: %u", doc.overflowed());
            //LogHandler::debug(_TAG, "Doc memory: %u", doc.memoryUsage());
            //LogHandler::debug(_TAG, "Doc capacity: %u", doc.capacity());
            File file = LittleFS.open(filepath, FILE_WRITE);
            if (serializeJson(doc, file) == 0)
            {
                LogHandler::error(_TAG, "Failed to write to file: %s", filepath);
                file.close();
                xSemaphoreGive(mutex);
                saving = false;
                return false;
            }
            LogHandler::debug(_TAG, "File contents: %s", file.readString().c_str());
            file.close();
            printFree();
        }
        saving = false;
        xSemaphoreGive(mutex);
        return true;
    }

    static bool checkForFileAndLoad(const char* path, JsonDocument &doc, bool &loadDefault) {
        if(!LittleFS.exists(path)) 
        {
            loadDefault = true;
        }
        if(loadDefault) 
        {
            if(!defaultJsonFile(path))
                return false;
        }
        DeserializationError::Code code;
        return loadJsonFromFile(path, doc, code);
        // I decided against auto resetting defaults.
        // Need a way to allow the user to choose to set defaults or not.
        // if(!loadJsonFromFile(path, doc, code)) 
        // {
        //     if(code == DeserializationError::Code::EmptyInput)
        //     {
        //         // Force a default file
        //         // Sometimes the file gets emptied out. Wish I knew how...
        //         LogHandler::error(_TAG, "Sometimes the file gets emptied out. Setting %s to default. Sorry.", path);
        //         loadDefault = true;
        //         if(!defaultJsonFile(path))
        //             return false;
        //         return loadJsonFromFile(path, doc, code);
        //     }
        //     else
        //         return false;
        // } 
        // else
        //     return true;
    }

    static bool defaultJsonFile(const char* path) {
        LogHandler::debug(_TAG, "Defaulting file %s", path);
        if(LittleFS.exists(path)) {
            LogHandler::debug(_TAG, "Deleting file %s", path);
            if(!LittleFS.remove(path)) {
                LogHandler::error(_TAG, "Error deleting %s!", path);
                return false;
            }
        }
        LogHandler::debug(_TAG, "Creating file %s", path);
        File newFile = LittleFS.open(path, FILE_WRITE, true);
        if(!newFile) {
            LogHandler::error(_TAG, "Error creating %s!", path);
            return false;
        }
        newFile.print("{}");
        newFile.flush();
        newFile.close();
        return true;
    }

    static bool loadJsonFromFile(const char* path, JsonDocument &doc, DeserializationError::Code& code) {
        LogHandler::debug(_TAG, "Loading json file %s", path);
        if (!LittleFS.exists(path)) {
            LogHandler::error(_TAG, "%s did not exist!", path);
            return false;
        }

        File file = LittleFS.open(path, FILE_READ);
        if(!file) {
            LogHandler::error(_TAG, "%s failed to open!", path);
            return false;
        }
        if(LogHandler::logDeserializationError(_TAG, deserializeJson(doc, file), file.name(), code)) {
            file.close();
            return false;
        }
        file.close();
        return true;
    }

    static void setBuildFeatures()
    {
        int index = 0;
#if WIFI_TCODE
        LogHandler::debug("setBuildFeatures", "WIFI_TCODE");
        buildFeatures[index] = BuildFeature::WIFI;
        index++;
#endif
#if BLUETOOTH_TCODE
        LogHandler::debug("setBuildFeatures", "BLUETOOTH_TCODE");
        buildFeatures[index] = BuildFeature::BLUETOOTH;
        index++;
#endif
#if BLE_TCODE
        LogHandler::debug("setBuildFeatures", "BLE_TCODE");
        buildFeatures[index] = BuildFeature::BLE;
        index++;
#endif
#if DEBUG_BUILD
        LogHandler::debug("setBuildFeatures", "DEBUG_BUILD");
        buildFeatures[index] = BuildFeature::DEBUG;
        index++;
#endif
#ifdef ESP32_DA
        LogHandler::debug("setBuildFeatures", "ESP32_DA");
        buildFeatures[index] = BuildFeature::DA;
        index++;
#endif
#if BUILD_TEMP
        LogHandler::debug("setBuildFeatures", "BUILD_TEMP");
        buildFeatures[index] = BuildFeature::TEMP;
        index++;
#endif
#if BUILD_DISPLAY
        LogHandler::debug("setBuildFeatures", "BUILD_DISPLAY");
        buildFeatures[index] = BuildFeature::DISPLAY_;
        index++;
#endif
// #if TCODE_V2
//         LogHandler::debug("setBuildFeatures", "TCODE_V2");
//         buildFeatures[index] = BuildFeature::HAS_TCODE_V2;
//         index++;
// #endif
#if SECURE_WEB
        LogHandler::debug("setBuildFeatures", "HTTPS");
        buildFeatures[index] = BuildFeature::HTTPS;
        index++;
#endif
#if COEXIST
        LogHandler::debug("setBuildFeatures", "COEXIST");
        buildFeatures[index] = BuildFeature::COEXIST_FEATURE;
        index++;
#endif
        buildFeatures[(int)BuildFeature::MAX_FEATURES - 1] = {};
    }

    static void setMotorType()
    {
#ifdef MOTOR_TYPE_SERVO
       m_settingsFactory->setValue(MOTOR_TYPE_SETTING, (int)MotorType::Servo);
#elif defined MOTOR_TYPE_BLDC
       m_settingsFactory->setValue(MOTOR_TYPE_SETTING, (int)MotorType::BLDC);
#endif
    }

